cases/210728/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     4.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }


    outlet
    {
        type            calculated;
        value           uniform 0;
    }


    top
    {
        type            calculated;
        value           uniform 0;
    }


    bottom
    {
        type            nutkWallFunction;//nutUBlendedWallFunction;
        value           uniform 0;
    }

    // frontAndBack
    // {
    //     type            symmetry;
    // } 

    front
    {
        type            calculated;
        value           uniform 0;
    }


    back
    {
        type            calculated;
        value           uniform 0;
    }


    building
    {
        type            nutkWallFunction;//nutUBlendedWallFunction;
        value           uniform 0;
    }


}

// ************************************************************************* //
