cases/210728/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

  Phi
{
  solver          GAMG;
  smoother        DIC;

  tolerance       1e-06;
  relTol          0.01;
}
    "(p|rho|pcorr)"
    {
		/*
        solver GAMG;
        tolerance 1e-07;
        relTol 0.001;
        smoother GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 1250;
        agglomerator faceAreaPair;
        mergeLevels 1;
        */
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0.1;

    }


	"(p|rho|pcorr)Final"
	{
        solver          GAMG;
        tolerance       1e-04;
        relTol          0;
        smoother GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 1250;
        agglomerator faceAreaPair;
        mergeLevels 1;

	}

    "(U|e|k|epsilon|omega|nuTilda)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        nSweeps         2;
        tolerance       1e-05;
        relTol          0.05;
    }

    "(U|k|epsilon|omega|nuTilda)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    correctPhi yes;
    nOuterCorrectors    2;
    nCorrectors         3;
    nNonOrthogonalCorrectors 3;
    momentumPredictor no;
    consistent 	no;

   residualControl
   {
        "(U|k|epsilon|omega|p|nuTilda)"
        {
            relTol          0.0;
            tolerance       0.01;
        }
    }

}


relaxationFactors
{
    fields
    {
        "p.*"           0.3;
	"rho.*"	        0.3;
	"(.*)Final"	1.0;
    }

    equations
    {
        "U.*"                   0.7;
        "(k|epsilon|omega).*"   0.3;
	"(.*)Final"	        1.0;
    }
}


// ************************************************************************* //
